Revit 2027 API
FabricationConnectorInfo Properties
The FabricationConnectorInfo type exposes the following members.
Properties
Name | Description
BodyConnectorId |  Fabrication body connector Id.
DoubleWallConnectorId |  Fabrication double wall connector Id.
FabricationIndex |  The index of the connector shown within the fabrication software.
IsBodyConnectorLocked |  Fabrication body connector lock.
IsDoubleWallConnectorLocked |  Fabrication double wall connector lock.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
See Also
Reference
FabricationConnectorInfo Class
Autodesk.Revit.DB Namespace